alibaba/AliOS-Things/platform/mcu/bk7231s/beken/ip/mac/mac_frame.h
#define MAC_FCTRL_TODS_FROMDS          (MAC_FCTRL_TODS | MAC_FCTRL_FROMDS)

/// FRAME CONTROL : Type information including Type and SubType
#define MAC_FCTRL_TYPESUBTYPE_MASK      (MAC_FCTRL_TYPE_MASK | MAC_FCTRL_SUBT_MASK)
#define MAC_FCTRL_ASSOCREQ              (MAC_FCTRL_MGT_T     | MAC_FCTRL_ASSOCREQ_ST)
#define MAC_FCTRL_ASSOCRSP              (MAC_FCTRL_MGT_T     | MAC_FCTRL_ASSOCRSP_ST)
#define MAC_FCTRL_REASSOCREQ            (MAC_FCTRL_MGT_T     | MAC_FCTRL_REASSOCREQ_ST)
#define MAC_FCTRL_REASSOCRSP            (MAC_FCTRL_MGT_T     | MAC_FCTRL_REASSOCRSP_ST)
#define MAC_FCTRL_PROBEREQ              (MAC_FCTRL_MGT_T     | MAC_FCTRL_PROBEREQ_ST)
#define MAC_FCTRL_PROBERSP              (MAC_FCTRL_MGT_T     | MAC_FCTRL_PROBERSP_ST)
#define MAC_FCTRL_BEACON                (MAC_FCTRL_MGT_T     | MAC_FCTRL_BEACON_ST)
#define MAC_FCTRL_ATIM                  (MAC_FCTRL_MGT_T     | MAC_FCTRL_ATIM_ST)
#define MAC_FCTRL_DISASSOC              (MAC_FCTRL_MGT_T     | MAC_FCTRL_DISASSOC_ST)
#define MAC_FCTRL_AUTHENT               (MAC_FCTRL_MGT_T     | MAC_FCTRL_AUTHENT_ST)
#define MAC_FCTRL_DEAUTHENT             (MAC_FCTRL_MGT_T     | MAC_FCTRL_DEAUTHENT_ST)
#define MAC_FCTRL_ACTION                (MAC_FCTRL_MGT_T     | MAC_FCTRL_ACTION_ST)
#define MAC_FCTRL_ACTION_NO_ACK         (MAC_FCTRL_MGT_T     | MAC_FCTRL_ACTION_NO_ACK_ST)
#define MAC_FCTRL_BFM_REPORT_POLL       (MAC_FCTRL_CTRL_T    | MAC_FCTRL_BFM_REPORT_POLL_ST)
#define MAC_FCTRL_VHT_NDPA              (MAC_FCTRL_CTRL_T    | MAC_FCTRL_VHT_NDPA_ST)
#define MAC_FCTRL_BA                    (MAC_FCTRL_CTRL_T    | MAC_FCTRL_BA_ST)
#define MAC_FCTRL_BAR                   (MAC_FCTRL_CTRL_T    | MAC_FCTRL_BAR_ST)
#define MAC_FCTRL_PSPOLL                (MAC_FCTRL_CTRL_T    | MAC_FCTRL_PSPOLL_ST)
#define MAC_FCTRL_RTS                   (MAC_FCTRL_CTRL_T    | MAC_FCTRL_RTS_ST)
#define MAC_FCTRL_CTS                   (MAC_FCTRL_CTRL_T    | MAC_FCTRL_CTS_ST)
#define MAC_FCTRL_ACK                   (MAC_FCTRL_CTRL_T    | MAC_FCTRL_ACK_ST)
#define MAC_FCTRL_CFEND                 (MAC_FCTRL_CTRL_T    | MAC_FCTRL_CFEND_ST)
#define MAC_FCTRL_CFEND_CFACK           (MAC_FCTRL_CFEND     | MAC_CFACK_ST_BIT)
#define MAC_FCTRL_DATA_CFACK            (MAC_FCTRL_DATA_T    | MAC_CFACK_ST_BIT)
#define MAC_FCTRL_DATA_CFPOLL           (MAC_FCTRL_DATA_T    | MAC_CFPOLL_ST_BIT)
#define MAC_FCTRL_DATA_CFACKPOLL        (MAC_FCTRL_DATA_T    | MAC_FCTRL_DATACFACKPOLL_ST)
#define MAC_FCTRL_NULL_FUNCTION         (MAC_FCTRL_DATA_T    | MAC_NODATA_ST_BIT)
#define MAC_FCTRL_NULL_CFACK            (MAC_FCTRL_NULL_FUNCTION  | MAC_CFACK_ST_BIT)
#define MAC_FCTRL_NULL_CFPOLL           (MAC_FCTRL_NULL_FUNCTION  | MAC_CFPOLL_ST_BIT)
#define MAC_FCTRL_NULL_CFACKPOLL        (MAC_FCTRL_NULL_FUNCTION  | MAC_FCTRL_DATACFACKPOLL_ST)
#define MAC_FCTRL_QOS_DATA              (MAC_FCTRL_DATA_T    | MAC_QOS_ST_BIT)
#define MAC_FCTRL_QOS_DATA_CFACK        (MAC_FCTRL_QOS_DATA  | MAC_CFACK_ST_BIT)
#define MAC_FCTRL_QOS_DATA_CFPOLL       (MAC_FCTRL_QOS_DATA  | MAC_CFPOLL_ST_BIT)
#define MAC_FCTRL_QOS_DATA_CFACKPOLL    (MAC_FCTRL_QOS_DATA  | MAC_FCTRL_DATACFACKPOLL_ST)
#define MAC_FCTRL_QOS_NULL              (MAC_FCTRL_QOS_DATA  | MAC_NODATA_ST_BIT)
#define MAC_FCTRL_QOS_NULL_CFACK        (MAC_FCTRL_QOS_DATA  | MAC_FCTRL_NULL_CFACK)
#define MAC_FCTRL_QOS_NULL_CFPOLL       (MAC_FCTRL_QOS_DATA  | MAC_FCTRL_NULL_CFPOLL)
#define MAC_FCTRL_QOS_NULL_CFACKPOLL    (MAC_FCTRL_QOS_DATA  | MAC_FCTRL_NULL_CFACKPOLL)

#define MAC_FCTRL_IS(fc, type) (((fc) & MAC_FCTRL_TYPESUBTYPE_MASK) == MAC_FCTRL_##type)

/*
 * FIELD DESCRIPTION
 ****************************************************************************************
 */
/// DURATION FIELD
#define MAC_DURATION_LEN                2

/// ASSOCIATION ID FIELD
#define MAC_AID_MSK                     0x3FFF

/// SEQUENCE CONTROL FIELD
#define MAC_SEQCTRL_LEN                 2
#define MAC_SEQCTRL_NUM_OFT             4
#define MAC_SEQCTRL_NUM_MSK             0xFFF0
#define MAC_SEQCTRL_NUM_MAX             (MAC_SEQCTRL_NUM_MSK >> MAC_SEQCTRL_NUM_OFT)
#define MAC_SEQCTRL_FRAG_OFT            0
#define MAC_SEQCTRL_FRAG_MSK            0x000F

// SECURITY
#define MAC_HDR_TSC_LEN                 6
#define MAC_TKIP_TSC1_OFT               0
#define MAC_TKIP_TSC0_OFT               2
#define MAC_TKIP_KEYID_OFT              3
#define MAC_CCMP_PN0_OFT                0
#define MAC_CCMP_PN1_OFT                1
#define MAC_CCMP_RSV_OFT                2
#define MAC_CCMP_PN2BIT_OFT             8
#define MAC_IV_EXTIV                    0x20000000

/// QOS CONTROL FIELD
#define MAC_QOSCTRL_LEN                 2
#define MAC_QOSCTRL_UP_OFT              0
#define MAC_QOSCTRL_UP_MSK              0x0007
#define MAC_QOSCTRL_EOSP_OFT            4
#define MAC_QOSCTRL_EOSP                0x10
#define MAC_QOSCTRL_QUEUE_SIZE_OFT      8
#define MAC_QOSCTRL_QUEUE_SIZE_NEGLECTED 0xFF
#define MAC_QOSCTRL_ACK_OFT             5
#define MAC_QOSCTRL_ACK_NORMAL          0x0000
#define MAC_QOSCTRL_ACK_NOACK           0x0020
#define MAC_QOSCTRL_ACK_NOEXPL          0x0040
#define MAC_QOSCTRL_ACK_BLOCK           0x0060
#define MAC_QOSCTRL_AMSDU_OFT           7
#define MAC_QOSCTRL_AMSDU_PRESENT       CO_BIT(7)
#define MAC_QOSCTRL_MESH_CTRL_PRESENT   CO_BIT(8)
#define MAC_QOSCTRL_MESH_POWER_SAVE_LVL CO_BIT(9)
#define MAC_QOSCTRL_MESH_RSPI           CO_BIT(10)

/// HT CONTROL FIELD
#define MAC_HTCTRL_LEN                  4

// SUPPORTED RATES MAXIMUM LENGTH
#define MAC_SUPPORTED_RATES_LEN   8

// CAPABILITY INFORMATION FIELD
#define MAC_CAPA_ESS                    CO_BIT(0)
#define MAC_CAPA_IBSS                   CO_BIT(1)
#define MAC_CAPA_CFPOLL                 CO_BIT(2)
#define MAC_CAPA_CFREQ                  CO_BIT(3)
#define MAC_CAPA_PRIVA                  CO_BIT(4)
#define MAC_CAPA_SHORT_PREAMBLE         CO_BIT(5)
#define MAC_CAPA_PBCB                   CO_BIT(6)
#define MAC_CAPA_AGILITY                CO_BIT(7)
#define MAC_CAPA_SPECTRUM               CO_BIT(8)
#define MAC_CAPA_QOS                    CO_BIT(9)
#define MAC_CAPA_SHORT_SLOT             CO_BIT(10)
//#define MAC_CAPA_ROBUST_SECURITY       CO_BIT(11)
#define MAC_CAPA_APSD                   CO_BIT(11)
#define MAC_CAPA_DSSS_OFDM              CO_BIT(13)
#define MAC_CAPA_DELAYED_BA             CO_BIT(14)
#define MAC_CAPA_IMMEDIATE_BA           CO_BIT(15)
#define MAC_CAPA_BA_POLICY              (MAC_CAPA_DELAYED_BA | MAC_CAPA_IMMEDIATE_BA)

