alibaba/AliOS-Things/platform/mcu/bk7231s/beken/ip/mac/mac_frame.h
/// Structure of a Probe Request frame
__PACKED struct preq_frame
{
    /// MAC Header
    struct mac_hdr h;
    /// Rest of the payload
    uint8_t payload[];
};

/// Structure of a Block Acknowledgment Request frame
struct bar_frame
{
    /// MAC Header
    struct mac_hdr_ctrl h;
    /// BAR control
    uint16_t bar_cntrl;
    /// BAR information
    uint16_t bar_information;
};

/// Structure of a Block Acknowledgment frame
__PACKED struct ba_frame
{
    /// MAC Header
    struct mac_hdr_ctrl h;
    /// BA control
    uint16_t ba_cntrl;
    /// BA Start Sequence Control
    uint16_t ssc;
    /// BA bitmap
    uint16_t bitmap[4];
};

/// Structure of A-MSDU Header
__PACKED struct amsdu_hdr
{
    // Destination Address
    struct mac_addr da;
    // Source Address
    struct mac_addr sa;
    // Length
    uint16_t len;
} ;

///Payload length of the BAR frame
#define BAR_PAYLOAD_LEN        (sizeof_b(struct bar_frame))
///Byte length of the BAR frame, including FCS
#define BAR_FRM_LEN_WITH_FCS   (BAR_PAYLOAD_LEN + MAC_FCS_LEN)

///BAR frame body BAR Control field
#define BAR_CNTL_ACK_TYPE_BIT    CO_BIT(0)
#define BAR_CNTL_MULTI_TID_BIT   CO_BIT(1)
#define BAR_CNTL_COMPRESSED_BIT  CO_BIT(2)

#define BAR_CNTL_TID_OFT         12
#define BAR_CNTL_TID_MSK         (0xF<<BAR_CNTL_TID_OFT)

/// Compressed BlockAck frame length
#define BA_FRM_LEN               (sizeof_b(struct ba_frame))





/// @} end of group
#endif // _MAC_FRAME_H_
